---
kind: enumMember
id: F:Autodesk.Revit.DB.DeleteWorksetOption.DeleteAllElements
enum: Autodesk.Revit.DB.DeleteWorksetOption
source: html/f49f5cf3-7707-f004-acec-e816ad74a08b.htm
---
# Autodesk.Revit.DB.DeleteWorksetOption.DeleteAllElements

Delete a workset together with all the elements in this workset.